Revit 2026 API

# ElectricalSystemTrueLoad Property

---

The TrueLoad value of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TrueLoad { get; set; }
```
```vb
Public Property TrueLoad As Double
	Get
	Set
```
```cpp
public:
property double TrueLoad {
	double get ();
	void set (double value);
}
```
```fsharp
member TrueLoad : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the TrueLoad value of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace